## GIT

- git은 파일에서 발생한 변경사항을 추적하는 시스템
- 데스크탑에 저장하거나 클라우드에 저장하거나
- 팀원간의 공유 및 공동 작업에 용이

Repositories

: 저장 폴더

Commits

: 파일 변경을 기록

예전 작업으로 돌아가고 싶을 때 큰 역할을 함

Branches

: 나무의 가지

실험적인 작업을 하고 싶을 때 사용

Git과 Github

: Git은 변경 사항 추적 시스템

: Github는 변경 사항을 저장할 수 있는 클라우드 서비스

- biitbucket

변경과 추가를 git에서 다 하고 그것을 클라우드에 추가하는 역할이 github

## **인터넷**

인터넷은 1960년도에 핵 전쟁에 대한 공포가 크게 달한시기에 만들어졌다.

당시 미국은 펜타곤을 잃으면 통신 시스템을 모두 잃게 됨

- > 펜타곤을 핵으로 공격하면 우리 망해 (통신 마비)
- > 분산

웸 서버: index.html 파일을 인터넷을 통해 웹서버에 전달

웹 브라우저: 파일을 해석해 사람이 볼 수 있는 문서의 형태로 보여줌

world wide web

: www.

인터넷은 어떻게 동작할까?

Ip Address

한 쪽에서 다른 쪽으로 데이터를 전달하기 위해서 사용

아이피라는 규칙에 따라서 받는 사람과 보내는 사람의 주소를 적고

그리고 우리가 요청하는 정보에 대한 내용들을 작성

나뉘게 된 단위를 패킷이라고 말함

웹주소 (사람들이 이해하는 주소)

아이피- 논리적 주소 (컴퓨터가 이해하는 주소)

랜칼 - 물리적 주소

주소창에 구글 닷컴을 치는 순간 **아이피 주소로 바뀌고 (DNS)**

아이피라는 규칙에 따라 데이터를 패킷 형태로 나눔

패킷(나눠진 정보)은 해당하는 네트워크로 가게 되고

네트워크에 가게 되면 브로윤캐슬을 통해서 물리적 주소를 랜칼에 가 있는 곳에 접근에서 원하는 데이터를 다시 가져오는 과정을 겪게 됨

TCP_ 검퓨터의 규칙(룰)

HTML은 http. 처럼 주소로 이어짐

왜냐면 HTNL이 텍스트 형태니까!

그리고 나머지 SSD랑 자바스크립트는 다르게 됨

이렇게 텍스트 주소로 이어지고 안 이어지고가 TCP의 규칙에 의해 결정됨

이게 규칙임!

A에서 B로 패킷이 전달되기 위해서 거처야 하는 과정

TCP를 통해서 B에 전달

HTTP를 통해서 B에 전달

IP: 패킷들이 찾아오기 위한 주소

Port: 수 많은 프로그램들이 자신만의 포트를 가지고 있음/ 아이피를 기다림

어느 프로그램에 전달해야 하는지 구분하기 위해서 사용하는 것이 포트
